[M_Ep2_Henchman MissionDefinition]
MissionDescription="When good Jack leaves you for dead [location] Windshare West [-location], you will find yourself in the cold and meet Boatmaster CL4PTP, the last one on Pandora.. He made you his servant. You have to help him kill Jack and save Pandora..<br><br>But before doing all this, you have to solve a very important problem. Claptrap's eyes have been taken by criminals and you need to help him recover.."

[M_Ep2_Henchman:FindEye1 MissionObjectiveSetDefinition]
MissionSummaryOverride="Claptrap's eyes rolled back."

[M_Ep2_Henchman:ReturnClaptrapsEyeSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You killed the knuckle dredger that stole Claptrap's points.. Now he has to be decisive.."


[M_Ep2b_Henchman MissionDefinition]
MissionDescription="Sir Hammerlock suggests that you need better protection if you want to keep [Ledge] South Ledge [-place] alive.. He wants you to go to the abandoned store and the old camp of Red Raiders.. This way you can buy a good picture."
MissionSummary="Visit the Red Bandit's abandoned base."

[M_Ep2b_Henchman:BreakingTheFenceSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lord Hammerlock has sent you to the ancient dungeon of the Crimson Rider to find the perfect shield.. Unfortunately, the safe house elevator is not broken.. You will find the appropriate fuse on the back of the outlet. Please close this store if possible. You can keep yourself safe.."

[M_Ep2b_Henchman:FusePluggedInSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lord Hamerlock sends you to the ancient cave of the Purple Wolves in search of better weapons.. Until there is a scholarship, no scholarship is accepted.. But Jeet found something.. Claptrop gets there and asks someone to connect the fuse for the elevator so he can get the shield.."

[M_Ep2b_Henchman:GetFuseSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lord Hammerlock sends you to the old Crimson Raider stronghold to find a better shield. Unfortunately, nothing can be safely stored in the elevator.. You can find an agent at the nearest bandit camp."

[M_Ep2b_Henchman:PilferShieldSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock sends you to the old Crimson Rider hideout for better armor.. Now the asylum elevator is running again, nothing prevents you from getting up and getting a new shield.."

[M_Ep2b_Henchman:RunThroughFence MissionObjectiveDefinition]
ProgressMessage="run to the fence"

[M_Ep2c_Henchman MissionDefinition]
MissionDescription="Now that your friends (wizards) are well armed and ready for battle, Granstan decides it's time to head to Saint [location], the last free city on Pandora.. [LOCATION] [-LOCATION] To get to the shrine, you must steal a ship from the evil Captain Flint.. However, there is an obstacle between you and Flint. Flint's partner, explosives expert Boom Boom."
TurnInDescription="Killing Captain Flint increases the average literacy of the entire district by ten.. Now there's nothing between you and Claptrap on a fifteen hour ice journey.. “Beautiful!"

[M_Ep2c_Henchman:BoardClaptrapsBoatSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Now that your team (that's you!) is armed and hungry for battle, Cliptrap thinks it's time to head to Sanctuary [-Location], the last independent city on Pandora [-Location].. Captain Flint, leader of the pirate guard, holds the key to the hatch until the captors escape.. Now that you have the key, you can use Cliptrap to head to [Location] Sanctuary [-Location] and join Handsome Jack in battle.."

[M_Ep2c_Henchman:CatchupToClaptrapSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You must steal the Claptrap from Captain Flint to reach the shrine [--where].. But there is a hurdle between you and Flint: Flint's assistant Boom Bevum Bomb Expert.. After a collision with a Boom Bevum Claptrap gun, a dark blue burst.. You have to think about it.."

[M_Ep2c_Henchman:EquipGrenadeMod_Set MissionObjectiveSetDefinition]
MissionDescriptionOverride="Boom Boom is dead.. Claptrap will ask you to switch to explosive mode. Vikas falls to his death preparing Captain Flint to attack his ship.."

[M_Ep2c_Henchman:FindHellfistSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Captain Flint, captain of the pirates, holds the keys to Claptrap's ship.. [Location] If you want to go to the temple, you have to kill him and get the key.."

[M_Ep2c_Henchman:FireClaptrapSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[Location] Sanctuary [- Location] To get there, you have to steal a steamship from the evil Captain Flint.. Once Boom Boom is dead, you have completely defeated the locked door with Clipperp.. Fortunately, Claptrap had an idea. An old bomb gun was used to blow up the gate.."

[M_Ep2c_Henchman:ProceedToHellfistSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[Status] [-Stay] To get to the Asylum, you have to steal Claptrap's ship from the evil boss Flint, who has the key to Claptrap's ship.. [source] If you want to go to the temple [-source] you have to kill him and destroy the key.."
